Repository: aigamer-dev/Trip-Wizards
Catalog: travel_wizards/lib/src/l10n/app_*.arb
Languages: gu, kn, ml, mr, or, ta, te, ur

# appTitle
source: Travel Wizards
gu: ટ્રાવેલ વિઝાર્ડ્સ
kn: ಟ್ರಾವೆಲ್ ವಿಜಾರ್ಡ್ಸ್
ml: ട്രാവൽ വിസാർഡ്സ്
mr: ट्रॅव्हल विझार्ड्स
or: ଟ୍ରାଭେଲ୍ ୱିଜାର୍ଡସ୍
ta: டிராவல் விசார்ட்ஸ்
te: ట్రావెల్ విజార్డ్స్
ur: ٹریول وزارڈز

# searchPlaceholder
source: Travel Wizards
gu: ટ્રાવેલ વિઝાર્ડ્સ
kn: ಟ್ರಾವೆಲ್ ವಿಜಾರ್ಡ್ಸ್
ml: ട്രാവൽ വിസാർഡ്സ്
mr: ट्रॅव्हल विझार्ड्स
or: ଟ୍ରାଭେଲ୍ ୱିଜାର୍ଡସ୍
ta: டிராவல் விசார்ட்ஸ்
te: ట్రావెల్ విజార్డ్స్
ur: ٹریول وزارڈز

source: Menu
gu: મેનૂ
kn: ಮೆನು
ml: മെനു
mr: मेनू
or: ମେନୁ
ta: மெனு
te: మెను
ur: مینیو

source: Open
gu: ખોલો
kn: ತೆರೆಯಿರಿ
ml: തുറക്കുക
mr: उघडा
or: ଖୋଲନ୍ତୁ
ta: திறக்க
te: తెరవండి
ur: کھولیں

source: Explore
gu: એક્સપ્લોર
kn: ಎಕ್ಸ್‌ಪ್ಲೋರ್
ml: എക്‌സ്‌പ്ലോർ
mr: एक्सप्लोर
or: ଏକ୍ସପ୍ଲୋର୍
ta: எக்ஸ்ப்ளோர்
te: ఎక్స్ప్లోర్
ur: ایکسپلور

source: Home
gu: હોમ
kn: ಮನೆ
ml: ഹോം
mr: होम
or: ମୂଳ ପୃଷ୍ଠା
ta: முகப்பு
te: హోమ్
ur: ہوم

source: Settings
gu: સેટિંગ્સ
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ml: ക്രമീകരണങ്ങൾ
mr: सेटिंग्ज
or: ସେଟିଙ୍ଗ୍ସ
ta: அமைப்புகள்
te: సెట్టింగ్స్
ur: سیٹنگز

source: Generation In Progress
gu: જનરેશન પ્રોગ્રેસમાં
kn: ಜನರೇಷನ್ ಪ್ರಗತಿಯಲ್ಲಿ
ml: ജനറേഷൻ പുരോഗമിക്കുന്നു
mr: जनरेशन प्रोग्रेसमध्ये
or: ଜେନରେସନ୍ ଚାଲିଛି
ta: தொகுப்பு நடைபெற்று கொண்டிருக்கிறது
te: జనరేషన్ ప్రోగ్రెస్‌లో ఉంది
ur: جنریشن جاری ہے

source: Ongoing Trips
gu: ચાલુ પ્રવાસો
kn: ನಡೆಯುತ್ತಿರುವ ಪ್ರಯಾಣಗಳು
ml: ഓൺഗോയിംഗ് യാത്രകൾ
mr: सुरू असलेली ट्रिप्स
or: ଚାଲୁ ଯାତ୍ରା
ta: நடைபெறும் பயணங்கள்
te: జరుగుతున్న ప్రయాణాలు
ur: جاری سفر

source: Planned Trips
gu: આયોજિત પ્રવાસો
kn: ಯೋಜಿತ ಪ್ರಯಾಣಗಳು
ml: പ്ലാൻ ചെയ്ത യാത്രകൾ
mr: नियोजित ट्रिप्स
or: ଯୋଜିତ ଯାତ୍ରା
ta: திட்டமிட்ட பயணங்கள்
te: ప్లాన్ చేసిన ప్రయాణాలు
ur: منصوبہ بند سفر

source: Suggested Trips
gu: સૂચિત પ્રવાસો
kn: ಸೂಚಿಸಲಾದ ಪ್ರಯಾಣಗಳು
ml: ശുപാർശ ചെയ്യുന്ന യാത്രകൾ
mr: सूचित ट्रिप्स
or: ପ୍ରସ୍ତାବିତ ଯାତ୍ରା
ta: பரிந்துரைக்கப்பட்ட பயணங்கள்
te: సూచించిన ప్రయాణాలు
ur: تجویز کردہ سفر

source: Add Trip
gu: પ્રવાસ ઉમેરો
kn: ಪ್ರಯಾಣವನ್ನು ಸೇರಿಸಿ
ml: യാത്ര ചേർക്കുക
mr: ट्रिप जोडा
or: ଯାତ୍ରା ଯୋଗ କରନ୍ତୁ
ta: பயணத்தைச் சேர்க்கவும்
te: ప్రయాణాన్ని జోడించండి
ur: سفر شامل کریں

source: Theme Mode
gu: થીમ મોડ
kn: ಥೀಮ್ ಮೋಡ್
ml: തീം മോഡ്
mr: थीम मोड
or: ଥିମ୍ ମୋଡ୍
ta: தீம் முறை
te: థీమ్ మోడ్
ur: تھیم موڈ

source: Language
gu: ભાષા
kn: ಭಾಷೆ
ml: ഭാഷ
mr: भाषा
or: ଭାଷା
ta: மொழி
te: భాష
ur: زبان

source: System Default
gu: સિસ્ટમ ડિફોલ્ટ
kn: ಸಿಸ್ಟಮ್ ಡೀಫಾಲ್ಟ್
ml: സിസ്റ്റം ഡീഫോൾട്ട്
mr: सिस्टम डिफॉल्ट
or: ସିଷ୍ଟମ୍ ଡିଫଲ୍ଟ
ta: கணினி இயல்புநிலை
te: సిస్టమ్ డిఫాల్ట్
ur: سسٹم ڈیفالٹ

source: Light
gu: લાઇટ
kn: ಲೈಟ್
ml: ലൈറ്റ്
mr: लाइट
or: ଲାଇଟ୍
ta: லைட்
te: లైట్
ur: لائٹ

source: Dark
gu: ડાર્ક
kn: ಡಾರ್ಕ್
ml: ഡാർക്ക്
mr: डार्क
or: ଡାର୍କ୍
ta: டார்க்
te: డార్క్
ur: ڈارک

source: Results for
gu: માટેના પરિણામો
kn: ಫಲಿತಾಂಶಗಳು
ml: ഫലം
mr: यांचे परिणाम
or: ଫଳାଫଳ
ta: இதற்கான முடிவுகள்
te: ఫలితాలు
ur: کے نتائج

source: Filters
gu: ફિલ્ટર્સ
kn: ಫಿಲ್ಟರ್‌ಗಳು
ml: ഫിൽറ്ററുകൾ
mr: फिल्टर्स
or: ଫିଲ୍ଟର୍ସ
ta: வடிப்பான்கள்
te: ఫిల్టర్లు
ur: فلٹرز

source: Clear filters
gu: ફિલ્ટર્સ સાફ કરો
kn: ಫಿಲ್ಟರ್‌ಗಳನ್ನು ತೆರವುಗೊಳಿಸಿ
ml: ഫിൽറ്ററുകൾ നീക്കംചെയ്യുക
mr: फिल्टर्स साफ करा
or: ଫିଲ୍ଟର୍ସ କ୍ଲିୟାର୍ କରନ୍ତୁ
ta: வடிப்பான்களை அழிக்கவும்
te: ఫిల్టర్‌లు క్లియర్ చేయండి
ur: فلٹرز صاف کریں

# tagWeekend
source: Weekend
gu: વીકએન્ડ
kn: ವೀಕೆಂಡ್
ml: വീക്കൻഡ്
mr: वीकेंड
or: ସପ୍ତାହାନ୍ତ
ta: வீக்கெண்ட்
te: వీకెండ్
ur: ویک اینڈ

# tagAdventure
source: Adventure
gu: એડવેન્ચર
kn: ಸಾಹಸ
ml: അഡ്വെഞ്ചർ
mr: अ‍ॅडव्हेंचर
or: ଅଭିଯାନ
ta: சாகசம்
te: అడ్వెంచర్
ur: ایڈونچر

# tagBudget
source: Budget
gu: બજેટ
kn: ಬಜೆಟ್
ml: ബജറ്റ്
mr: बजेट
or: ବଜେଟ୍
ta: பட்ஜெட்
te: బడ్జెట్
ur: بجٹ

# budgetLow
source: Low budget
gu: ઓછું બજેટ
kn: ಕಡಿಮೆ ಬಜೆಟ್
ml: കുറഞ്ഞ ബജറ്റ്
mr: कमी बजेट
or: କମ୍ ବଜେଟ୍
ta: குறைந்த பட்ஜெட்
te: తక్కువ బడ్జెట్
ur: کم بجٹ

# budgetMedium
source: Medium budget
gu: મધ્યમ બજેટ
kn: ಮಧ್ಯಮ ಬಜೆಟ್
ml: ഇടത്തരം ബജറ്റ്
mr: मध्यम बजेट
or: ମଧ୍ୟମ ବଜେଟ୍
ta: நடுத்தர பட்ஜெட்
te: మధ్యస్థ బడ్జెట్
ur: درمیانہ بجٹ

# budgetHigh
source: High budget
gu: ઉચ્ચ બજેટ
kn: ಹೆಚ್ಚು ಬಜೆಟ್
ml: ഉയർന്ന ബജറ്റ്
mr: जास्त बजेट
or: ଉଚ୍ଚ ବଜେଟ୍
ta: அதிக பட்ஜெட்
te: అధిక బడ్జెట్
ur: زیادہ بجٹ

# duration2to3
source: 2–3 days
gu: 2–3 દિવસ
kn: 2–3 ದಿನಗಳು
ml: 2–3 ദിവസം
mr: २–३ दिवस
or: 2–3 ଦିନ
ta: 2–3 நாட்கள்
te: 2–3 రోజులు
ur: 2–3 دن

# duration4to5
source: 4–5 days
gu: 4–5 દિવસ
kn: 4–5 ದಿನಗಳು
ml: 4–5 ദിവസം
mr: ४–५ दिवस
or: 4–5 ଦିନ
ta: 4–5 நாட்கள்
te: 4–5 రోజులు
ur: 4–5 دن

# duration6plus
source: 6+ days
gu: 6+ દિવસ
kn: 6+ ದಿನಗಳು
ml: 6+ ദിവസം
mr: ६+ दिवस
or: 6+ ଦିନ
ta: 6+ நாட்கள்
te: 6+ రోజులు
ur: 6+ دن

source: Save
gu: સાચવો
kn: ಸೇವ್ ಮಾಡಿ
ml: സേവ് ചെയ്യുക
mr: सेव्ह करा
or: ସେଭ୍ କରନ୍ତୁ
ta: சேமிக்கவும்
te: సేవ్ చేయండి
ur: محفوظ کریں

source: Unsave
gu: સંચય દૂર કરો
kn: ಸೇವ್ ತೆಗೆದುಹಾಕಿ
ml: സേവ് നീക്കംചെയ്യുക
mr: सेव्ह काढा
or: ସେଭ୍ ହଟାନ୍ତୁ
ta: சேமிப்பை நீக்கு
te: సేవ్ తొలగించండి
ur: محفوظی ہٹائیں

source: Save idea
gu: આઈડિયા સાચવો
kn: ಆಲೋಚನೆಯನ್ನು ಸೇವ್ ಮಾಡಿ
ml: ഐഡിയ സേവ് ചെയ്യുക
mr: आयडिया सेव्ह करा
or: ଆଇଡିଆ ସେଭ୍ କରନ୍ତୁ
ta: யோசனையை சேமிக்கவும்
te: ఐడియాను సేవ్ చేయండి
ur: آئیڈیا محفوظ کریں

source: Unsave idea
gu: આઈડિયાનો સંચય દૂર કરો
kn: ಆಲೋಚನೆ ಸೇವ್ ತೆಗೆದುಹಾಕಿ
ml: ഐഡിയ സേവ് നീക്കംചെയ്യുക
mr: आयडिया सेव्ह काढा
or: ଆଇଡିଆ ସେଭ୍ ହଟାନ୍ତୁ
ta: யோசனை சேமிப்பை நீக்கு
te: ఐడియా సేవ్ తొలగించండి
ur: آئیڈیا محفوظی ہٹائیں

source: Saved to your ideas
gu: તમારા આઈડિયામાં સાચવ્યું
kn: ನಿಮ್ಮ ಆಲೋಚನೆಗಳಲ್ಲಿ ಸೇವ್ ಮಾಡಲಾಗಿದೆ
ml: നിങ്ങളുടെ ഐഡിയാസിൽ സേവ് ചെയ്തു
mr: तुमच्या आयडियात सेव्ह केले
or: ଆପଣଙ୍କ ଆଇଡିଆରେ ସେଭ୍ ହେଲା
ta: உங்கள் யோசனைகளில் சேமிக்கப்பட்டது
te: మీ ఐడియాస్‌లో సేవ్ అయింది
ur: آپ کے آئیڈیاز میں محفوظ ہوا

source: Removed from your ideas
gu: તમારા આઈડિયાથી દૂર કર્યું
kn: ನಿಮ್ಮ ಆಲೋಚನೆಗಳಿಂದ ತೆಗೆದುಹಾಕಲಾಗಿದೆ
ml: നിങ്ങളുടെ ഐഡിയാസിൽ നിന്ന് നീക്കം ചെയ്തു
mr: तुमच्या आयडियातून काढले
or: ଆପଣଙ୍କ ଆଇଡିଆରୁ ହଟାଯାଇଛି
ta: உங்கள் யோசனைகளில் இருந்து நீக்கப்பட்டது
te: మీ ఐడియాస్ నుండి తొలగించబడింది
ur: آپ کے آئیڈیاز سے ہٹا دیا گیا

source: Idea
gu: આઈડિયા
kn: ಆಲೋಚನೆ
ml: ഐഡിയ
mr: आयडिया
or: ଆଇଡିଆ
ta: யோசனை
te: ఐడియా
ur: آئیڈیا

# ideaLabel
source: Idea: {title}
gu: આઈડિયા: {title}
kn: ಆಲೋಚನೆ: {title}
ml: ഐഡിയ: {title}
mr: आयडिया: {title}
or: ଆଇଡିଆ: {title}
ta: யோசனை: {title}
te: ఐడియా: {title}
ur: آئیڈیا: {title}

# ideasFallbackToLocal
source: Network issue: showing local ideas
gu: નેટવર્ક સમસ્યા: સ્થાનિક આઈડિયાઓ બતાવવામાં આવી રહ્યા છે
kn: ನೆಟ್‌ವರ್ಕ್ ಸಮಸ್ಯೆ: ಸ್ಥಳೀಯ ಆಲೋಚನೆಗಳನ್ನು ತೋರಿಸಲಾಗುತ್ತಿದೆ
ml: നെറ്റ്‌വർക്ക് പ്രശ്നം: പ്രാദേശിക ആശയങ്ങൾ കാണിക്കുന്നു
mr: नेटवर्क समस्या: स्थानिक आयडिया दाखवत आहोत
or: ନେଟୱର୍କ ସମସ୍ୟା: ସ୍ଥାନୀୟ ଆଇଡିଆ ଦେଖାଯାଉଛି
ta: நெட்வொர்க் சிக்கல்: உள்ளூர் யோசனைகள் காட்டப்படுகின்றன
te: నెట్‌వర్క్ సమస్య: స్థానిక ఐడియాలు చూపిస్తున్నాం
ur: نیٹ ورک مسئلہ: مقامی آئیڈیاز دکھائے جا رہے ہیں

source: Retry
gu: ફરી પ્રયત્ન કરો
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
ml: വീണ്ടും ശ്രമിക്കുക
mr: पुन्हा प्रयत्न करा
or: ପୁନର୍ବାର ଚେଷ୍ଟା କରନ୍ତୁ
ta: மீண்டும் முயற்சிக்கவும்
te: మళ్ళీ ప్రయత్నించండి
ur: دوبارہ کوشش کریں
