Repository: aigamer-dev/Trip-Wizards
Catalog: travel_wizards/lib/src/core/l10n/app_*.arb
Languages: bn, hi

# appTitle
source: Travel Wizards
bn: ট্রাভেল উইজার্ডস
hi: ट्रैवल विज़ार्ड्स

# searchPlaceholder
source: Travel Wizards
bn: ট্রাভেল উইজার্ডস
hi: ट्रैवल विज़ार्ड्स

source: Menu
bn: মেনু
hi: मेनू

source: Open
bn: খুলুন
hi: खोलें

source: Explore
bn: এক্সপ্লোর
hi: एक्सप्लोर

source: Home
bn: হোম
hi: होम

source: Settings
bn: সেটিংস
hi: सेटिंग्स

source: Generation In Progress
bn: জেনারেশন প্রগ্রেসে
hi: जनरेशन प्रगति पर

source: Ongoing Trips
bn: চলমান ভ্রমণ
hi: चल रही यात्राएँ

source: Planned Trips
bn: পরিকল্পিত ভ্রমণ
hi: योजनाबद्ध यात्राएँ

source: Suggested Trips
bn: প্রস্তাবিত ভ্রমণ
hi: सुझाई गई यात्राएँ

source: Add Trip
bn: ভ্রমণ যোগ করুন
hi: यात्रा जोड़ें

source: Theme Mode
bn: থিম মোড
hi: थीम मोड

source: Language
bn: ভাষা
hi: भाषा

source: System Default
bn: সিস্টেম ডিফল্ট
hi: सिस्टम डिफ़ॉल्ट

source: Light
bn: লাইট
hi: लाइट

source: Dark
bn: ডার্ক
hi: डार्क

source: Results for
bn: এর ফলাফল
hi: इनके लिए परिणाम

# languageSelectionIntro
source: Choose your preferred app language. Native Indian languages are localised while others use Google Translate instantly.
bn: অ্যাপের জন্য আপনার পছন্দের ভাষা বেছে নিন। দেশীয় ভারতীয় ভাষাগুলি স্থানীয়ভাবে উপলব্ধ, অন্যগুলি সঙ্গে সঙ্গেই Google Translate থেকে অনুবাদ হয়।
hi: अपनी पसंदीदा ऐप भाषा चुनें। देशी भारतीय भाषाएँ पूरी तरह स्थानीयकृत हैं जबकि अन्य भाषाएँ तुरंत Google Translate से सक्षम होती हैं।

# languageSearchHint
source: Search languages
bn: ভাষা অনুসন্ধান করুন
hi: भाषाएँ खोजें

# languageEmptyState
source: No languages match your search yet.
bn: আপনার অনুসন্ধানের সঙ্গে এখনও কোনো ভাষা মেলেনি।
hi: आपकी खोज से मेल खाने वाली कोई भाषा नहीं मिली।

# languageSetupMessage
source: Setting up {languageName}...
bn: {languageName} সেটআপ করা হচ্ছে...
hi: {languageName} सेट किया जा रहा है...

# languageChangedNative
source: Language changed to {languageName}
bn: ভাষা {languageName} এ পরিবর্তিত হয়েছে
hi: भाषा {languageName} में बदल दी गई

# languageChangedTranslated
source: Language changed to {languageName} (Google Translate)
bn: ভাষা {languageName} এ পরিবর্তিত হয়েছে (Google Translate)
hi: भाषा {languageName} में बदल दी गई (Google Translate)

source: Done
bn: সম্পন্ন
hi: हो गया

# languageManageTitle
source: Manage your app language globally
bn: অ্যাপের ভাষা সর্বত্র নিয়ন্ত্রণ করুন
hi: अपनी ऐप की भाषा को वैश्विक रूप से प्रबंधित करें

# languageManageDescription
source: Choose your preferred language from Settings → Language and we'll apply it everywhere.
bn: Settings → Language থেকে আপনার পছন্দের ভাষা বেছে নিন, আমরা সেটি সর্বত্র প্রয়োগ করব।
hi: सेटिंग्स → भाषा में अपनी पसंदीदा भाषा चुनें और हम इसे हर जगह लागू करेंगे।

# languageManageCta
source: Open language settings
bn: ভাষা সেটিংস খুলুন
hi: भाषा सेटिंग्स खोलें

source: Filters
bn: ফিল্টার
hi: फ़िल्टर

source: Clear filters
bn: ফিল্টার মুছুন
hi: फ़िल्टर साफ़ करें

# tagWeekend
source: Weekend
bn: সপ্তাহান্ত
hi: सप्ताहांत

# tagAdventure
source: Adventure
bn: রোমাঞ্চ
hi: रोमांच

# tagBudget
source: Budget
bn: বাজেট
hi: बजट

# budgetLow
source: Low budget
bn: কম বাজেট
hi: कम बजट

# budgetMedium
source: Medium budget
bn: মাঝারি বাজেট
hi: मध्यम बजट

# budgetHigh
source: High budget
bn: উচ্চ বাজেট
hi: उच्च बजट

# duration2to3
source: 2–3 days
bn: ২–৩ দিন
hi: 2–3 दिन

# duration4to5
source: 4–5 days
bn: ৪–৫ দিন
hi: 4–5 दिन

# duration6plus
source: 6+ days
bn: ৬+ দিন
hi: 6+ दिन

source: Save
bn: সেভ করুন
hi: सहेजें

source: Unsave
bn: সেভ বাতিল
hi: सहेजा हटाएं

source: Save idea
bn: আইডিয়া সেভ করুন
hi: विचार सहेजें

source: Unsave idea
bn: আইডিয়া সেভ বাতিল
hi: विचार सहेजा हटाएं

source: Saved to your ideas
bn: আপনার আইডিয়াতে সেভ হয়েছে
hi: आपके विचारों में सहेजा गया

source: Removed from your ideas
bn: আপনার আইডিয়া থেকে সরানো হয়েছে
hi: आपके विचारों से हटाया गया

source: Idea
bn: আইডিয়া
hi: विचार

# ideaLabel
source: Idea: {title}
bn: আইডিয়া: {title}
hi: विचार: {title}

# ideasFallbackToLocal
source: Network issue: showing local ideas
bn: নেটওয়ার্ক সমস্যা: স্থানীয় আইডিয়া দেখানো হচ্ছে
hi: नेटवर्क समस्या: स्थानीय विचार दिखाए जा रहे हैं

source: Retry
bn: পুনরায় চেষ্টা করুন
hi: पुनः प्रयास करें

# profileOfflineTitle
source: Offline mode
bn: অফলাইনে মোড
hi: ऑफ़लाइन मोड

# profileOfflineDescription
source: We'll sync your changes as soon as you reconnect. You can keep editing safely.
bn: আপনি পুনরায় সংযুক্ত হলেই আমরা আপনার পরিবর্তন সিঙ্ক করব। নিশ্চিন্তে সম্পাদনা চালিয়ে যান।
hi: जैसे ही आप दोबारा ऑनलाइन होंगे, हम आपके परिवर्तन सिंक कर देंगे। आप सुरक्षित रूप से संपादन जारी रख सकते हैं।

# profileDiscardEditsLabel
source: Discard edits
bn: সম্পাদনা বাতিল করুন
hi: संपादन रद्द करें

# profileAccountBasicsTitle
source: Account basics
bn: অ্যাকাউন্টের প্রাথমিক তথ্য
hi: खाते की मूल जानकारी

# profileAccountBasicsSubtitle
source: These details power personalised suggestions and shared trip experiences.
bn: এই তথ্যগুলো ব্যক্তিগতকৃত প্রস্তাব ও ভাগ করা ভ্রমণ অভিজ্ঞতাকে সমৃদ্ধ করে।
hi: ये विवरण व्यक्तिगत सुझावों और साझा यात्रा अनुभवों को बेहतर बनाते हैं।

# profileFullNameLabel
source: Full name
bn: পূর্ণ নাম
hi: पूरा नाम

# profileUsernameLabel
source: Username
bn: ব্যবহারকারীর নাম
hi: उपयोगकर्ता नाम

# profileUsernameHelper
source: Used for public sharing links and concierge assistance
bn: পাবলিক শেয়ার লিঙ্ক ও কনসিয়ার্জ সহায়তার জন্য ব্যবহৃত
hi: सार्वजनिक लिंक और कंसीयर्ज सहायता के लिए उपयोग किया जाता है

# profileEmailLabel
source: Email
bn: ইমেল
hi: ईमेल

# profileGenderLabel
source: Gender
bn: লিঙ্গ
hi: लिंग

# profileGenderOptionPreferNot
source: Prefer not to say
bn: বলতে অনিচ্ছুক
hi: बताने से परहेज़

# profileGenderOptionMale
source: Male
bn: পুরুষ
hi: पुरुष

# profileGenderOptionFemale
source: Female
bn: মহিলা
hi: महिला

# profileGenderOptionOther
source: Other
bn: অন্যান্য
hi: अन्य

# profileDobLabel
source: Date of birth
bn: জন্মতারিখ
hi: जन्म तिथि

# profileDobFormatError
source: Use the format YYYY-MM-DD
bn: দয়া করে YYYY-MM-DD বিন্যাস ব্যবহার করুন
hi: कृपया YYYY-MM-DD प्रारूप का उपयोग करें

# profileGoogleManagedNotice
source: These details come from your Google account. Email support@travelwizards.com if they need updating.
bn: এই তথ্যগুলো আপনার Google অ্যাকাউন্ট থেকে এসেছে। আপডেট প্রয়োজন হলে support@travelwizards.com এ ইমেল করুন।
hi: ये विवरण आपके Google खाते से आते हैं। बदलाव की आवश्यकता हो तो support@travelwizards.com पर ईमेल करें।

# profileHomeTitle
source: Where you call home
bn: আপনার ঘর কোথায়
hi: आप कहाँ रहते हैं

# profileHomeSubtitle
source: Let us tailor weather alerts and concierge tips around your go-to destinations.
bn: আপনার প্রিয় গন্তব্য অনুযায়ী আবহাওয়া সতর্কতা ও কনসিয়ার্জ টিপস আমরা সাজিয়ে দেব।
hi: हम आपके पसंदीदा गंतव्यों के लिए मौसम अलर्ट और कंसीयर्ज सुझाव अनुकूल करेंगे।

# profileCountryLabel
source: Country
bn: দেশ
hi: देश

# profileStateLabel
source: State / Region
bn: রাজ্য / অঞ্চল
hi: राज्य / क्षेत्र

# profileCityLabel
source: City
bn: শহর
hi: शहर

# profileTasteTitle
source: Taste & care
bn: রুচি ও যত্ন
hi: स्वाद और देखभाल

# profileTasteSubtitle
source: We use this to highlight dining you'll love and avoid things you can't have.
bn: আপনি যেসব খাবার পছন্দ করেন তা দেখাতে এবং যেগুলো এড়ানো উচিত সেগুলো বাদ দিতে আমরা এটি ব্যবহার করি।
hi: हम इन्हें आपके पसंदीदा भोजन दिखाने और जिनसे आपको समस्या है उनसे बचने के लिए उपयोग करते हैं।

# profileFoodPrefsLabel
source: Food preferences
bn: খাবারের পছন্দ
hi: भोजन संबंधी पसंद

# profileFoodPrefsHelper
source: Comma-separated (e.g. Vegan, Nut-free, Farm-to-table)
bn: কমা দিয়ে আলাদা করুন (যেমন ভেগান, বাদাম-মুক্ত, ফার্ম-টু-টেবিল)
hi: कॉमा से अलग करें (जैसे वीगन, नट-फ़्री, फार्म-टू-टेबल)

# profileAllergiesLabel
source: Allergies / notes
bn: এলার্জি / নোট
hi: एलर्जी / नोट्स

# profilePhotoSectionTitle
source: Profile photo
bn: প্রোফাইল ছবি
hi: प्रोफ़ाइल फोटो

# profilePhotoGuidance
source: Use a high-quality square image for best results.
bn: সেরা ফলের জন্য উচ্চ মানের বর্গাকার ছবি ব্যবহার করুন।
hi: सर्वश्रेष्ठ परिणामों के लिए उच्च गुणवत्ता वाली चौकोर छवि का उपयोग करें।

# profileUploadPhotoButton
source: Upload new photo
bn: নতুন ছবি আপলোড করুন
hi: नई फोटो अपलोड करें

# profileUseGooglePhotoButton
source: Use Google photo
bn: Google ছবিটি ব্যবহার করুন
hi: Google फोटो का उपयोग करें

# profileRemovePhotoButton
source: Remove photo
bn: ছবি সরান
hi: फोटो हटाएँ

# profileOfflinePhotoWarning
source: You're offline. Reconnect to upload a new photo.
bn: আপনি অফলাইনে আছেন। নতুন ছবি আপলোড করতে সংযোগ করুন।
hi: आप ऑफ़लाइन हैं। नई फोटो अपलोड करने के लिए कनेक्ट करें।

# profilePhotoManagedNotice
source: Profile photos for Google sign-ins must be updated from your Google Account. We'll mirror updates automatically.
bn: Google সাইন-ইনের জন্য প্রোফাইল ছবি আপনার Google অ্যাকাউন্ট থেকেই আপডেট করতে হবে। আমরা পরিবর্তন স্বয়ংক্রিয়ভাবে আনব।
hi: Google साइन-इन के लिए प्रोफ़ाइल फोटो आपके Google खाते से ही अपडेट की जा सकती है। हम बदलाव खुद-ब-खुद ले आएँगे।

# profileDiscardChangesLabel
source: Discard changes
bn: পরিবর্তন বাতিল করুন
hi: परिवर्तन रद्द करें

# profileLastSavedAtLabel
source: Last saved at {time}
bn: শেষবার {time} এ সেভ হয়েছে
hi: अंतिम बार {time} पर सहेजा गया

# profileCacheMessage
source: Your profile is cached for offline access and synchronises as soon as you reconnect.
bn: আপনার প্রোফাইল অফলাইন অ্যাক্সেসের জন্য সংরক্ষিত আছে এবং আপনি পুনরায় সংযুক্ত হলেই সিঙ্ক হবে।
hi: आपकी प्रोफ़ाइल ऑफ़लाइन एक्सेस के लिए कैश की गई है और दोबारा जुड़ते ही सिंक हो जाएगी।

# profileSaveTooltipPending
source: Save profile updates
bn: প্রোফাইল আপডেট সেভ করুন
hi: प्रोफ़ाइल अपडेट सहेजें

# profileSaveTooltipSaved
source: All changes saved
bn: সব পরিবর্তন সেভ হয়েছে
hi: सभी परिवर्तन सहेजे गए

# profilePageTitle
source: Profile
bn: প্রোফাইল
hi: प्रोफ़ाइल

# profileBackdropDefaultName
source: Your profile
bn: আপনার প্রোফাইল
hi: आपकी प्रोफ़ाइल

# profileManagedByGoogleBadge
source: Managed by Google
bn: Google দ্বারা পরিচালিত
hi: Google द्वारा प्रबंधित

# profileOfflineBadge
source: Offline
bn: অফলাইন
hi: ऑफ़लाइन

# profileSignedInToUploadError
source: You need to be signed in to upload.
bn: আপলোড করতে লগ ইন থাকা প্রয়োজন।
hi: अपलोड करने के लिए आपको लॉग इन रहना होगा।

# profileReconnectToUploadError
source: Reconnect to upload a new photo.
bn: নতুন ছবি আপলোড করতে পুনরায় সংযোগ করুন।
hi: नई फोटो अपलोड करने के लिए दोबारा कनेक्ट करें।

# profileReadFileError
source: Could not read the selected file.
bn: নির্বাচিত ফাইলটি পড়া যায়নি।
hi: चयनित फ़ाइल पढ़ी नहीं जा सकी।

# profileFileTooLargeError
source: Please choose an image under 5 MB.
bn: ৫ এমবি-র কম সাইজের ছবি নির্বাচন করুন।
hi: कृपया 5 MB से छोटी छवि चुनें।

# profilePhotoUpdatedMessage
source: Photo updated. Changes will auto-save.
bn: ছবি আপডেট হয়েছে। পরিবর্তন স্বয়ংক্রিয়ভাবে সেভ হবে।
hi: फोटो अपडेट कर दी गई। बदलाव स्वतः सहेजे जाएँगे।

# profilePhotoUploadFailedMessage
source: Photo upload failed: {error}
bn: ছবি আপলোড ব্যর্থ: {error}
hi: फोटो अपलोड विफल: {error}

# profileSignedInToSaveError
source: You need to be signed in to save.
bn: সেভ করতে লগ ইন থাকা প্রয়োজন।
hi: सहेजने के लिए आपको लॉग इन रहना होगा।

# profileFixHighlightedFieldsError
source: Please fix the highlighted fields.
bn: অনুগ্রহ করে হাইলাইট করা ঘরগুলো ঠিক করুন।
hi: कृपया हाइलाइट किए गए फ़ील्ड ठीक करें।

# profileSyncSuccessMessage
source: Profile synced across your devices.
bn: প্রোফাইল আপনার সব ডিভাইসে সিঙ্ক হয়েছে।
hi: प्रोफ़ाइल सभी उपकरणों पर सिंक हो गई।

# profileSyncOfflineMessage
source: Offline for now. We'll sync your profile when you reconnect.
bn: এখন অফলাইনে। আপনি সংযুক্ত হলেই প্রোফাইল সিঙ্ক করব।
hi: अभी ऑफ़लाइन हैं। जैसे ही आप कनेक्ट होंगे हम प्रोफ़ाइल सिंक कर देंगे।

# profileAutoSaveFailedMessage
source: Auto-save failed: {error}
bn: অটো-সেভ ব্যর্থ: {error}
hi: ऑटो-सेव विफल रहा: {error}

# profileSaveFailedMessage
source: Failed to save profile: {error}
bn: প্রোফাইল সেভ করা যায়নি: {error}
hi: प्रोफ़ाइल सहेजी नहीं जा सकी: {error}

# profileRevertedChangesMessage
source: Reverted unsaved changes.
bn: অসম্পাদিত পরিবর্তন ফিরিয়ে নেওয়া হয়েছে।
hi: अनसहेजे बदलाव वापस ले लिए गए।

# profileFieldRequired
source: {fieldName} is required
bn: {fieldName} আবশ্যক
hi: {fieldName} आवश्यक है

# profileUsernameTooShort
source: At least 3 characters
bn: কমপক্ষে ৩ টি অক্ষর
hi: कम से कम 3 अक्षर

# profileUsernameInvalid
source: Only letters, numbers, underscores or dots
bn: শুধু অক্ষর, সংখ্যা, আন্ডারস্কোর বা ডট ব্যবহার করা যাবে
hi: केवल अक्षर, अंक, अंडरस्कोर या डॉट की अनुमति है

# profileEmailInvalid
source: Enter a valid email address
bn: বৈধ ইমেল ঠিকানা লিখুন
hi: मान्य ईमेल पता दर्ज करें

source: Skip
bn: এড়িয়ে যান
hi: छोड़ें

# stepProgress
source: Step {current} of {total}
bn: ধাপ {current} এর মধ্যে {total}
hi: चरण {current} में से {total}

source: Welcome to Travel Wizards!
bn: Travel Wizards-এ স্বাগতম!
hi: Travel Wizards में आपका स्वागत है!

# personalizeExperience
source: Let's personalize your travel experience by learning about your preferences.
bn: চলুন আপনার পছন্দের ভিত্তিতে ভ্রমণ অভিজ্ঞতা ব্যক্তিগত করি।
hi: आइए आपकी यात्राओं को आपकी पसंद के अनुसार व्यक्तिगत बनाते हैं।

source: AI-powered trip planning
bn: এআই ভিত্তিক ভ্রমণ পরিকল্পনা
hi: एआई संचालित यात्रा योजना

source: Personalized recommendations
bn: ব্যক্তিগতকৃত সুপারিশ
hi: व्यक्तिगत अनुशंसाएँ

source: Collaborative trip planning
bn: সমষ্টিগত ভ্রমণ পরিকল্পনা
hi: सह-यात्रा योजना

# errorCompletingOnboarding
source: Error completing onboarding: {error}
bn: অনবোর্ডিং সম্পূর্ণ করতে ত্রুটি: {error}
hi: ऑनबोर्डिंग पूरा करने में त्रुटि: {error}
